WSDL/TankDipPosting2.WSDL

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <DoPosting xmlns="http://TankDip.Pertamina.com/">
      <dipData>
        <plant>string</plant>
        <dipDate>string</dipDate>
        <dipTime>string</dipTime>
        <dipTank>string</dipTank>
        <dipEvent>string</dipEvent>
        <dipOperation>string</dipOperation>
        <totalHeight>string</totalHeight>
        <totalHeightUOM>string</totalHeightUOM>
        <waterHeight>string</waterHeight>
        <waterHeightUOM>string</waterHeightUOM>
        <celciusMaterialTemp>string</celciusMaterialTemp>
        <celciusTestTemp>string</celciusTestTemp>
        <kglDensity>string</kglDensity>
        <shipment>string</shipment>
        <delivery>string</delivery>
      </dipData>
      <User>string</User>
      <Password>string</Password>
    </DoPosting>
  </soap12:Body>
</soap12:Envelope>